InformationRegisters/Б24_К_ИдентификаторыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_К_ИдентификаторыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Б24_К_ТипыДанныхДляОбменаСПорталом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Б24_К_ИдентификаторыОбъектов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	мНастройкиСинхронизации = Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьМассивНастроекПодключения();
	Для Каждого Выборка Из мНастройкиСинхронизации Цикл	
		
		Если НЕ ЗначениеЗаполнено(Выборка.Портал) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Элементы.Портал.СписокВыбора.НайтиПоЗначению(Выборка.Портал) = Неопределено Тогда
			Элементы.Портал.СписокВыбора.Добавить(Выборка.Портал);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	Если Запись.ТипДанных = ТипыДанныхДляОбменаСПорталом.ГруппаТовара ИЛИ Запись.ТипДанных = ТипыДанныхДляОбменаСПорталом.ГруппаТовара2 Тогда
		Элементы.Объект.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе
		Элементы.Объект.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
	КонецЕсли;

	Если Запись.ТипДанных = ТипыДанныхДляОбменаСПорталом.СвойствоЗаказа Тогда
		Элементы.КомандаЗагрузитьИдПлательщиков.Видимость 	= Истина;
		Элементы.ПодчиненныйОбъект.КнопкаВыбора 			= Ложь;	
	Иначе
		Элементы.КомандаЗагрузитьИдПлательщиков.Видимость 	= Ложь;
		Элементы.ПодчиненныйОбъект.КнопкаВыпадающегоСписка 	= Ложь;	
		Элементы.ПодчиненныйОбъект.КнопкаВыбора 			= Истина;	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗагрузитьИдПлательщиков(Команда)
	
	КоличествоНастроек = Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьКоличествоНастроекПодключения();
	
	Если КоличествоНастроек > 1 Тогда
		
		ВыбЗнач 	= Неопределено;
		
		Массив 		= Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Б24_К_НастройкиПодключения"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект);

		ПоказатьВводЗначения(Оповещение, ВыбЗнач, "Укажите настройку подключения", ОписаниеТипов);	
		
	Иначе
		ПараметрыДиалога = Новый Структура;	
		ПослеВводаЗначения(Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуПодключенияПоУмолчанию(), ПараметрыДиалога);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(ВыбЗнач, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбЗнач) Тогда

		НастройкаПодключения = ВыбЗнач; 

		Элементы.ПодчиненныйОбъект.СписокВыбора.Очистить();
		
		СтруктураНастроек =  Б24_К_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(НастройкаПодключения);  
		СтруктураНастроек = Неопределено;
		Если СтруктураНастроек = Неопределено Тогда
			ПоказатьПредупреждение(, "Не удалось подключиться к Битрикс24");
			Возврат;
		КонецЕсли;
		
		СтруктураНастроек.Логирование.Измерение1 = "Ручное получение данных";	
		СтруктураНастроек.Логирование.Измерение2 = "Получение плательщиков заказов";	
		
		Метод = "/rest/sale.persontype.list";
		
		Фильтр = "&filter[>ID]=0";
		
		СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, Метод, Фильтр); 
		
		Если СтруктураОтвета = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если СтруктураОтвета.Получить("result") <> неопределено Тогда
			
			Для каждого ТекЭлемент Из СтруктураОтвета.Получить("result") Цикл
				
				Если ТекЭлемент.Получить("active") <> "Y" Тогда
					Продолжить;
				КонецЕсли;
				
				Элементы.ПодчиненныйОбъект.СписокВыбора.Добавить(Формат(ТекЭлемент.Получить("id"), "ЧГ=0"), ТекЭлемент.Получить("name"));
				
			КонецЦикла;
		
		КонецЕсли;
		
		Следующие = СтруктураОтвета.Получить("next"); 
		
		Пока ЗначениеЗаполнено(Следующие) Цикл
			
			Следующие = Формат(Следующие, "ЧГ=0");

			ТелоHTTPЗапроса = "&start="+Следующие + Фильтр;	
			
			СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, Метод, ТелоHTTPЗапроса); 
			
			Если СтруктураОтвета = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			Если СтруктураОтвета.Получить("result") <> Неопределено Тогда
				
				Для каждого ТекЭлемент Из СтруктураОтвета.Получить("result") Цикл
					
					Если ТекЭлемент.Получить("active") <> Истина Тогда
						Продолжить;
					КонецЕсли;
					
					Элементы.ПодчиненныйОбъект.СписокВыбора.Добавить(Формат(ТекЭлемент.Получить("id"), "ЧГ=0"), ТекЭлемент.Получить("name"));
					
				КонецЦикла;
			КонецЕсли;
			
		   Следующие = СтруктураОтвета.Получить("next");
		   
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ПодчиненныйОбъект.КнопкаВыпадающегоСписка = Истина;	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	Если Запись.ТипДанных = ТипыДанныхДляОбменаСПорталом.ГруппаТовара ИЛИ Запись.ТипДанных = ТипыДанныхДляОбменаСПорталом.ГруппаТовара2 Тогда
		Элементы.Объект.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе
		Элементы.Объект.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
	КонецЕсли;

	Если Запись.ТипДанных = ТипыДанныхДляОбменаСПорталом.СвойствоЗаказа Тогда
		Элементы.КомандаЗагрузитьИдПлательщиков.Видимость 	= Истина;
		Элементы.ПодчиненныйОбъект.КнопкаВыбора 			= Ложь;	
	Иначе
		Элементы.КомандаЗагрузитьИдПлательщиков.Видимость 	= Ложь;
		Элементы.ПодчиненныйОбъект.КнопкаВыпадающегоСписка 	= Ложь;	
		Элементы.ПодчиненныйОбъект.КнопкаВыбора 			= Истина;	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
